Revit 2024 API
AdaptiveComponentInstanceUtils.HasAdaptiveFamilySymbol Method
 Verifies if a FamilyInstance has an Adaptive Family Symbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static bool HasAdaptiveFamilySymbol(
	FamilyInstance famInst
)
Visual Basic
Public Shared Function HasAdaptiveFamilySymbol ( _
	famInst As FamilyInstance _
) As Boolean
Visual C++
public:
static bool HasAdaptiveFamilySymbol(
	FamilyInstance^ famInst
)
Parameters
famInst
Type: Autodesk.Revit.DB.FamilyInstance
 The FamilyInstance
Return Value
 True if the FamilyInstance has an Adaptive Family Symbol.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AdaptiveComponentInstanceUtils Class
Autodesk.Revit.DB Namespace